# connection to mysql

...

In [10]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [11]:
%%sql
mysql+pymysql://w-alkao:mypassword@localhost

# Create database livestock and table animal

...

In [12]:
%%sql
CREATE DATABASE livestock CHARACTER SET "utf8";

 * mysql+pymysql://w-alkao:***@localhost
1 rows affected.

[]

In [13]:
%sql SHOW DATABASES;

 * mysql+pymysql://w-alkao:***@localhost
8 rows affected.

[('ap',),
 ('ex',),
 ('information_schema',),
 ('livestock',),
 ('mysql',),
 ('om',),
 ('performance_schema',),
 ('sys',)]

In [14]:
%sql USE livestock;

 * mysql+pymysql://w-alkao:***@localhost
0 rows affected.

[]

In [15]:
%%sql

CREATE TABLE Animal (
  id SMALLINT UNSIGNED NOT NULL AUTO_INCREMENT,
  species VARCHAR(40) NOT NULL,
  sex CHAR(1),
  birth_date DATETIME NOT NULL,
  name VARCHAR(30),
  comments TEXT,
  PRIMARY KEY(id)
) ENGINE=INNODB;

 * mysql+pymysql://w-alkao:***@localhost
0 rows affected.

[]

In [16]:
%sql SHOW TABLES;

 * mysql+pymysql://w-alkao:***@localhost
1 rows affected.

[('Animal',)]

In [17]:
%sql DESCRIBE Animal;

 * mysql+pymysql://w-alkao:***@localhost
6 rows affected.

[('id', 'smallint unsigned', 'NO', 'PRI', None, 'auto_increment'),
 ('species', 'varchar(40)', 'NO', '', None, ''),
 ('sex', 'char(1)', 'YES', '', None, ''),
 ('birth_date', 'datetime', 'NO', '', None, ''),
 ('name', 'varchar(30)', 'YES', '', None, ''),
 ('comments', 'text', 'YES', '', None, '')]

# Insert data into table Animal

## Single insertion

In [18]:
%%sql 

INSERT INTO Animal VALUES (
  1, "dog", "M", "2020-04-05 13:43:00", "Rox", "Bites a lot"
);

 * mysql+pymysql://w-alkao:***@localhost
1 rows affected.

[]

In [19]:
%%sql

INSERT INTO Animal VALUES (
  2, "cat", NULL, "2020-03-24 02:23:00", "Roucky", NULL
);

 * mysql+pymysql://w-alkao:***@localhost
1 rows affected.

[]

In [20]:
%%sql

INSERT INTO Animal VALUES (
  NULL, "cat", "F", "2020-09-13 15:02:00", "Schtroumpfette", NULL
);

 * mysql+pymysql://w-alkao:***@localhost
1 rows affected.

[]

In [21]:
%%sql

INSERT INTO Animal (species, sex, birth_date)
  VALUES ("turtle", "F", "2019-08-03 05:12:00");

INSERT INTO Animal (name, comments, birth_date, species)
  VALUES ("Choupi", "Born without a left ear", "2020-10-03 16:44:00", "cat");

INSERT INTO Animal (species, birth_date, comments, name, sex)
  VALUES ("turtle", "2019-06-13 08:17:00", "Weird shell", "Bobosse", "F");

 * mysql+pymysql://w-alkao:***@localhost
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [22]:
%%sql

INSERT INTO Animal 
SET name="Bobo", species="dog", sex="M", birth_date="2020-07-21 15:41:00";

 * mysql+pymysql://w-alkao:***@localhost
1 rows affected.

[]

In [23]:
%sql SELECT * FROM Animal;

 * mysql+pymysql://w-alkao:***@localhost
7 rows affected.

[(1, 'dog', 'M', datetime.datetime(2020, 4, 5, 13, 43), 'Rox', 'Bites a lot'),
 (2, 'cat', None, datetime.datetime(2020, 3, 24, 2, 23), 'Roucky', None),
 (3, 'cat', 'F', datetime.datetime(2020, 9, 13, 15, 2), 'Schtroumpfette', None),
 (4, 'turtle', 'F', datetime.datetime(2019, 8, 3, 5, 12), None, None),
 (5, 'cat', None, datetime.datetime(2020, 10, 3, 16, 44), 'Choupi', 'Born without a left ear'),
 (6, 'turtle', 'F', datetime.datetime(2019, 6, 13, 8, 17), 'Bobosse', 'Weird shell'),
 (7, 'dog', 'M', datetime.datetime(2020, 7, 21, 15, 41), 'Bobo', None)]

## multiple insertion

In [24]:
%%sql

INSERT INTO Animal (species, sex, birth_date, name) VALUES
("dog", "F", "2018-12-06 05:18:00", "Caroline"),
("cat", "M", "2018-09-11 15:38:00", "Bagherra"),
("turtle", NULL, "2020-08-23 05:18:00", NULL);

 * mysql+pymysql://w-alkao:***@localhost
3 rows affected.

[]

In [25]:
%sql SELECT * FROM Animal;

 * mysql+pymysql://w-alkao:***@localhost
10 rows affected.

[(1, 'dog', 'M', datetime.datetime(2020, 4, 5, 13, 43), 'Rox', 'Bites a lot'),
 (2, 'cat', None, datetime.datetime(2020, 3, 24, 2, 23), 'Roucky', None),
 (3, 'cat', 'F', datetime.datetime(2020, 9, 13, 15, 2), 'Schtroumpfette', None),
 (4, 'turtle', 'F', datetime.datetime(2019, 8, 3, 5, 12), None, None),
 (5, 'cat', None, datetime.datetime(2020, 10, 3, 16, 44), 'Choupi', 'Born without a left ear'),
 (6, 'turtle', 'F', datetime.datetime(2019, 6, 13, 8, 17), 'Bobosse', 'Weird shell'),
 (7, 'dog', 'M', datetime.datetime(2020, 7, 21, 15, 41), 'Bobo', None),
 (8, 'dog', 'F', datetime.datetime(2018, 12, 6, 5, 18), 'Caroline', None),
 (9, 'cat', 'M', datetime.datetime(2018, 9, 11, 15, 38), 'Bagherra', None),
 (10, 'turtle', None, datetime.datetime(2020, 8, 23, 5, 18), None, None)]

## Insertion from external file

In [26]:
ls

create_db_and_tables.ipynb  insert_update_delete_data.ipynb
data/                       README.md
foreign_key.ipynb           select_data_from_single_table.ipynb
index_fulltext.ipynb        select_from_two_table.ipynb

In [27]:
cat data/animals.csv

cat,M,2019-05-14 06:42:00,Boucan,NULL
cat,F,2016-05-19 16:06:00,Callune,NULL
cat,F,2019-05-14 06:45:00,Boule,NULL
cat,F,2018-04-20 03:26:00,Zara,NULL
cat,F,2017-03-12 12:00:00,Milla,NULL
cat,F,2016-05-19 15:59:00,Feta,NULL
cat,F,2018-04-20 03:20:00,Bilba,80% deaf in right ear
cat,F,2017-03-12 11:54:00,Cracotte,NULL
cat,F,2016-05-19 16:16:00,Cawette,NULL
turtle,F,2017-04-01 18:17:00,Nikki,NULL
turtle,F,2019-03-24 08:23:00,Tortilla,NULL
turtle,F,2019-03-26 01:24:00,Scroupy,NULL
turtle,F,2016-03-15 14:56:00,Lulla,NULL
turtle,F,2018-03-15 12:02:00,Dana,NULL
turtle,F,2019-05-25 19:57:00,Cheli,NULL
turtle,F,2017-04-01 03:54:00,Chicaca,NULL
turtle,F,2016-03-15 14:26:00,Redbul,Insomniac
turtle,M,2017-04-02 01:45:00,Spoutnik,NULL
turtle,M,2018-03-16 08:20:00,Bubulle,NULL
turtle,M,2018-03-15 18:45:00,Relou,Overweight
turtle,M,2019-05-25 18:54:00,Bulbizard,NULL
turtle,M,2017-03-04 19:36:00,Safran,NULL
parrot,M,2018-02-20 02:50:00,Gingko,NULL
parrot,M,2019-03-26 08:28:00,Bavard,NULL
parrot,F,2019-03-26 07:55:00,Parlotte,NULL
dog,F,2018-02-20 15:45:00,Canaille,NULL
dog,F,2019-05-26 08:54:00,Cali,NULL
dog,F,2017-04-24 12:54:00,Rouquine,NULL
dog,F,2019-05-26 08:56:00,Fila,NULL
dog,F,2018-02-20 15:47:00,Anya,NULL
dog,F,2019-05-26 08:50:00,Louya,NULL
dog,F,2018-03-10 13:45:00,Welva,NULL
dog,F,2017-04-24 12:59:00,Zira,NULL
dog,F,2019-05-26 09:02:00,Java,NULL
dog,M,2017-04-24 12:45:00,Balou,NULL
dog,M,2018-03-10 13:43:00,Pataud,NULL
dog,M,2017-04-24 12:42:00,Bouli,NULL
dog,M,2019-03-05 13:54:00,Zoulou,NULL
dog,M,2017-04-12 05:23:00,Cartouche,NULL
dog,M,2016-05-14 15:50:00,Zambo,NULL
dog,M,2016-05-14 15:48:00,Samba,NULL
dog,M,2018-03-10 13:40:00,Moka,NULL
dog,M,2016-05-14 15:40:00,Pilou,NULL
cat,M,2019-05-14 06:30:00,Fiero,NULL
cat,M,2017-03-12 12:05:00,Zonko,NULL
cat,M,2018-02-20 15:45:00,Filou,NULL
cat,M,2017-03-12 12:07:00,Farceur,NULL
cat,M,2016-05-19 16:17:00,Caribou,NULL
cat,M,2018-04-20 03:22:00,Capou,NULL
cat,M,2016-05-19 16:56:00,Raccou,No tail since birth

In [28]:
%%sql

LOAD DATA LOCAL INFILE "data/animals.csv" INTO TABLE Animal
FIELDS TERMINATED BY ","
LINES TERMINATED BY "\n"
(species, sex, birth_date, name, comments);

 * mysql+pymysql://w-alkao:***@localhost
(pymysql.err.OperationalError) (3948, 'Loading local data is disabled; this must be enabled on both the client and server sides')
[SQL: LOAD DATA LOCAL INFILE "data/animals.csv" INTO TABLE Animal
FIELDS TERMINATED BY ","
LINES TERMINATED BY "\n"
(species, sex, birth_date, name, comments);]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [29]:
%sql SHOW GLOBAL VARIABLES LIKE 'LOCAL_INFILE';

 * mysql+pymysql://w-alkao:***@localhost
1 rows affected.

[('local_infile', 'OFF')]

In [30]:
%sql SET GLOBAL LOCAL_INFILE=TRUE

 * mysql+pymysql://w-alkao:***@localhost
0 rows affected.

[]

In [31]:
%sql SHOW GLOBAL VARIABLES LIKE 'LOCAL_INFILE';

 * mysql+pymysql://w-alkao:***@localhost
1 rows affected.

[('local_infile', 'ON')]

In [32]:
%sql SHOW GLOBAL VARIABLES LIKE 'LOCAL_INFILE';

 * mysql+pymysql://w-alkao:***@localhost
1 rows affected.

[('local_infile', 'ON')]

In [33]:
%%sql

LOAD DATA INFILE "animals.csv" INTO TABLE Animal
FIELDS TERMINATED BY ","
LINES TERMINATED BY "\n"
(species, sex, birth_date, name, comments);

 * mysql+pymysql://w-alkao:***@localhost
(pymysql.err.OperationalError) (1290, 'The MySQL server is running with the --secure-file-priv option so it cannot execute this statement')
[SQL: LOAD DATA INFILE "animals.csv" INTO TABLE Animal
FIELDS TERMINATED BY ","
LINES TERMINATED BY "\n"
(species, sex, birth_date, name, comments);]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [34]:
%sql SHOW VARIABLES LIKE "secure_file_priv"

 * mysql+pymysql://w-alkao:***@localhost
1 rows affected.

[('secure_file_priv', '/var/lib/mysql-files/')]

In [35]:
ls /var/lib/mysql-files

ls: cannot open directory '/var/lib/mysql-files': Permission denied

In [36]:
%sql SET @@secure_file_priv="";

 * mysql+pymysql://w-alkao:***@localhost
(pymysql.err.OperationalError) (1238, "Variable 'secure_file_priv' is a read only variable")
[SQL: SET @@secure_file_priv="";]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [42]:
#type this command with root user copy this file in mysql-files
cp data/animals.csv /var/lib/mysql-files

cp: cannot stat '/var/lib/mysql-files/animals.csv': Permission denied

In [43]:
%%sql

LOAD DATA INFILE "/var/lib/mysql-files/animals.csv" INTO TABLE Animal
FIELDS TERMINATED BY ","
LINES TERMINATED BY "\n"
(species, sex, birth_date, name, comments);

 * mysql+pymysql://w-alkao:***@localhost
50 rows affected.

[]

In [44]:
%sql SELECT * FROM Animal;

 * mysql+pymysql://w-alkao:***@localhost
60 rows affected.

[(1, 'dog', 'M', datetime.datetime(2020, 4, 5, 13, 43), 'Rox', 'Bites a lot'),
 (2, 'cat', None, datetime.datetime(2020, 3, 24, 2, 23), 'Roucky', None),
 (3, 'cat', 'F', datetime.datetime(2020, 9, 13, 15, 2), 'Schtroumpfette', None),
 (4, 'turtle', 'F', datetime.datetime(2019, 8, 3, 5, 12), None, None),
 (5, 'cat', None, datetime.datetime(2020, 10, 3, 16, 44), 'Choupi', 'Born without a left ear'),
 (6, 'turtle', 'F', datetime.datetime(2019, 6, 13, 8, 17), 'Bobosse', 'Weird shell'),
 (7, 'dog', 'M', datetime.datetime(2020, 7, 21, 15, 41), 'Bobo', None),
 (8, 'dog', 'F', datetime.datetime(2018, 12, 6, 5, 18), 'Caroline', None),
 (9, 'cat', 'M', datetime.datetime(2018, 9, 11, 15, 38), 'Bagherra', None),
 (10, 'turtle', None, datetime.datetime(2020, 8, 23, 5, 18), None, None),
 (11, 'cat', 'M', datetime.datetime(2019, 5, 14, 6, 42), 'Boucan', 'NULL'),
 (12, 'cat', 'F', datetime.datetime(2016, 5, 19, 16, 6), 'Callune', 'NULL'),
 (13, 'cat', 'F', datetime.datetime(2019, 5, 14, 6, 45), 'Boule', 'NULL'),
 (14, 'cat', 'F', datetime.datetime(2018, 4, 20, 3, 26), 'Zara', 'NULL'),
 (15, 'cat', 'F', datetime.datetime(2017, 3, 12, 12, 0), 'Milla', 'NULL'),
 (16, 'cat', 'F', datetime.datetime(2016, 5, 19, 15, 59), 'Feta', 'NULL'),
 (17, 'cat', 'F', datetime.datetime(2018, 4, 20, 3, 20), 'Bilba', '80% deaf in right ear'),
 (18, 'cat', 'F', datetime.datetime(2017, 3, 12, 11, 54), 'Cracotte', 'NULL'),
 (19, 'cat', 'F', datetime.datetime(2016, 5, 19, 16, 16), 'Cawette', 'NULL'),
 (20, 'turtle', 'F', datetime.datetime(2017, 4, 1, 18, 17), 'Nikki', 'NULL'),
 (21, 'turtle', 'F', datetime.datetime(2019, 3, 24, 8, 23), 'Tortilla', 'NULL'),
 (22, 'turtle', 'F', datetime.datetime(2019, 3, 26, 1, 24), 'Scroupy', 'NULL'),
 (23, 'turtle', 'F', datetime.datetime(2016, 3, 15, 14, 56), 'Lulla', 'NULL'),
 (24, 'turtle', 'F', datetime.datetime(2018, 3, 15, 12, 2), 'Dana', 'NULL'),
 (25, 'turtle', 'F', datetime.datetime(2019, 5, 25, 19, 57), 'Cheli', 'NULL'),
 (26, 'turtle', 'F', datetime.datetime(2017, 4, 1, 3, 54), 'Chicaca', 'NULL'),
 (27, 'turtle', 'F', datetime.datetime(2016, 3, 15, 14, 26), 'Redbul', 'Insomniac'),
 (28, 'turtle', 'M', datetime.datetime(2017, 4, 2, 1, 45), 'Spoutnik', 'NULL'),
 (29, 'turtle', 'M', datetime.datetime(2018, 3, 16, 8, 20), 'Bubulle', 'NULL'),
 (30, 'turtle', 'M', datetime.datetime(2018, 3, 15, 18, 45), 'Relou', 'Overweight'),
 (31, 'turtle', 'M', datetime.datetime(2019, 5, 25, 18, 54), 'Bulbizard', 'NULL'),
 (32, 'turtle', 'M', datetime.datetime(2017, 3, 4, 19, 36), 'Safran', 'NULL'),
 (33, 'parrot', 'M', datetime.datetime(2018, 2, 20, 2, 50), 'Gingko', 'NULL'),
 (34, 'parrot', 'M', datetime.datetime(2019, 3, 26, 8, 28), 'Bavard', 'NULL'),
 (35, 'parrot', 'F', datetime.datetime(2019, 3, 26, 7, 55), 'Parlotte', 'NULL'),
 (36, 'dog', 'F', datetime.datetime(2018, 2, 20, 15, 45), 'Canaille', 'NULL'),
 (37, 'dog', 'F', datetime.datetime(2019, 5, 26, 8, 54), 'Cali', 'NULL'),
 (38, 'dog', 'F', datetime.datetime(2017, 4, 24, 12, 54), 'Rouquine', 'NULL'),
 (39, 'dog', 'F', datetime.datetime(2019, 5, 26, 8, 56), 'Fila', 'NULL'),
 (40, 'dog', 'F', datetime.datetime(2018, 2, 20, 15, 47), 'Anya', 'NULL'),
 (41, 'dog', 'F', datetime.datetime(2019, 5, 26, 8, 50), 'Louya', 'NULL'),
 (42, 'dog', 'F', datetime.datetime(2018, 3, 10, 13, 45), 'Welva', 'NULL'),
 (43, 'dog', 'F', datetime.datetime(2017, 4, 24, 12, 59), 'Zira', 'NULL'),
 (44, 'dog', 'F', datetime.datetime(2019, 5, 26, 9, 2), 'Java', 'NULL'),
 (45, 'dog', 'M', datetime.datetime(2017, 4, 24, 12, 45), 'Balou', 'NULL'),
 (46, 'dog', 'M', datetime.datetime(2018, 3, 10, 13, 43), 'Pataud', 'NULL'),
 (47, 'dog', 'M', datetime.datetime(2017, 4, 24, 12, 42), 'Bouli', 'NULL'),
 (48, 'dog', 'M', datetime.datetime(2019, 3, 5, 13, 54), 'Zoulou', 'NULL'),
 (49, 'dog', 'M', datetime.datetime(2017, 4, 12, 5, 23), 'Cartouche', 'NULL'),
 (50, 'dog', 'M', datetime.datetime(2016, 5, 14, 15, 50), 'Zambo', 'NULL'),
 (51, 'dog', 'M', datetime.datetime(2016, 5, 14, 15, 48), 'Samba', 'NULL'),
 (52, 'dog', 'M', datetime.datetime(2018, 3, 10, 13, 40), 'Moka', 'NULL'),
 (53, 'dog', 'M', datetime.datetime(2016, 5, 14, 15, 40), 'Pilou', 'NULL'),
 (54, 'cat', 'M', datetime.datetime(2019, 5, 14, 6, 30), 'Fiero', 'NULL'),
 (55, 'cat', 'M', datetime.datetime(2017, 3, 12, 12, 5), 'Zonko', 'NULL'),
 (56, 'cat', 'M', datetime.datetime(2018, 2, 20, 15, 45), 'Filou', 'NULL'),
 (57, 'cat', 'M', datetime.datetime(2017, 3, 12, 12, 7), 'Farceur', 'NULL'),
 (58, 'cat', 'M', datetime.datetime(2016, 5, 19, 16, 17), 'Caribou', 'NULL'),
 (59, 'cat', 'M', datetime.datetime(2018, 4, 20, 3, 22), 'Capou', 'NULL'),
 (60, 'cat', 'M', datetime.datetime(2016, 5, 19, 16, 56), 'Raccou', 'No tail since birth')]

# Create databases ap with tables: 
general_ledger_accounts, terms, vendors, invoices, invoice_line_items, vendor_contacts, invoice_archive

In [45]:
%sql SHOW DATABASES;

 * mysql+pymysql://w-alkao:***@localhost
8 rows affected.

[('ap',),
 ('ex',),
 ('information_schema',),
 ('livestock',),
 ('mysql',),
 ('om',),
 ('performance_schema',),
 ('sys',)]

In [46]:
ls

create_db_and_tables.ipynb  insert_update_delete_data.ipynb
data/                       README.md
foreign_key.ipynb           select_data_from_single_table.ipynb
index_fulltext.ipynb        select_from_two_table.ipynb

In [47]:
%%sql

DROP DATABASE IF EXISTS ap;
CREATE DATABASE ap;

 * mysql+pymysql://w-alkao:***@localhost
7 rows affected.
1 rows affected.

[]

In [15]:
%%sql

SHOW DATABASES;
USE ap;

 * mysql+pymysql://w-alkao:***@localhost
6 rows affected.
0 rows affected.

[]

In [20]:
%sql SHOW TABLES;

 * mysql+pymysql://w-alkao:***@localhost
0 rows affected.

[]

In [21]:
%%sql

CREATE TABLE General_ledger_accounts (
  account_number INT PRIMARY KEY,
  account_description VARCHAR(50) UNIQUE
);

LOAD DATA INFILE "/var/lib/mysql-files/data/general_ledger_accounts.csv"
INTO TABLE General_ledger_accounts
FIELDS TERMINATED BY ";"
LINES TERMINATED BY "\n"
(account_number, account_description);

 * mysql+pymysql://w-alkao:***@localhost
0 rows affected.
75 rows affected.

[]

In [22]:
%%sql

CREATE TABLE Terms (
  terms_id INT PRIMARY KEY AUTO_INCREMENT,
  terms_description VARCHAR(50) NOT NULL,
  terms_due_days INT NOT NULL
);

LOAD DATA INFILE "/var/lib/mysql-files/data/terms.csv"
INTO TABLE Terms
FIELDS TERMINATED BY ";"
LINES TERMINATED BY "\n"
(terms_id, terms_description, terms_due_days);

 * mysql+pymysql://w-alkao:***@localhost
0 rows affected.
5 rows affected.

[]

In [46]:
%%sql

CREATE TABLE Vendors
(
  vendor_id INT PRIMARY KEY AUTO_INCREMENT,
  vendor_name VARCHAR(50) NOT NULL UNIQUE,
  vendor_address1 VARCHAR(50),
  vendor_address2 VARCHAR(50),
  vendor_city VARCHAR(50) NOT NULL,
  vendor_state CHAR(2) NOT NULL,
  vendor_zip_code VARCHAR(20) NOT NULL,
  vendor_phone VARCHAR(50),
  vendor_contact_last_name VARCHAR(50),
  vendor_contact_first_name VARCHAR(50),
  default_terms_id INT NOT NULL,
  default_account_number INT NOT NULL,

  CONSTRAINT vendors_fk_terms FOREIGN KEY (default_terms_id)
    REFERENCES Terms (terms_id),
  CONSTRAINT vendors_fk_accounts FOREIGN KEY (default_account_number)
    REFERENCES General_ledger_accounts (account_number)
);

LOAD DATA INFILE "/var/lib/mysql-files/data/vendors.csv"
INTO TABLE Vendors
FIELDS TERMINATED BY ";"
LINES TERMINATED BY "\n"
(vendor_id, vendor_name, vendor_address1, vendor_address2, vendor_city, 
 vendor_state, vendor_zip_code, vendor_phone, vendor_contact_last_name,
 vendor_contact_first_name, default_terms_id, default_account_number);

 * mysql+pymysql://w-alkao:***@localhost
(pymysql.err.OperationalError) (1050, "Table 'Vendors' already exists")
[SQL: CREATE TABLE Vendors
(
  vendor_id INT PRIMARY KEY AUTO_INCREMENT,
  vendor_name VARCHAR(50) NOT NULL UNIQUE,
  vendor_address1 VARCHAR(50),
  vendor_address2 VARCHAR(50),
  vendor_city VARCHAR(50) NOT NULL,
  vendor_state CHAR(2) NOT NULL,
  vendor_zip_code VARCHAR(20) NOT NULL,
  vendor_phone VARCHAR(50),
  vendor_contact_last_name VARCHAR(50),
  vendor_contact_first_name VARCHAR(50),
  default_terms_id INT NOT NULL,
  default_account_number INT NOT NULL,

  CONSTRAINT vendors_fk_terms FOREIGN KEY (default_terms_id)
    REFERENCES Terms (terms_id),
  CONSTRAINT vendors_fk_accounts FOREIGN KEY (default_account_number)
    REFERENCES General_ledger_accounts (account_number)
);]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [58]:
%%sql

CREATE TABLE Invoices (
  invoice_id INT PRIMARY KEY AUTO_INCREMENT,
  vendor_id INT NOT NULL,
  invoice_number VARCHAR(50) NOT NULL,
  invoice_date DATE NOT NULL,
  invoice_total DECIMAL(9,2) NOT NULL,
  payment_total DECIMAL(9,2) NOT NULL DEFAULT 0,
  credit_total DECIMAL(9,2) NOT NULL DEFAULT 0,
  terms_id INT NOT NULL,
  invoice_due_date DATE NOT NULL,
  payment_date DATE,

  CONSTRAINT invoices_fk_vendors FOREIGN KEY (vendor_id)
    REFERENCES Vendors (vendor_id),
  CONSTRAINT invoices_fk_terms FOREIGN KEY (terms_id)
    REFERENCES Terms (terms_id)
);

LOAD DATA INFILE "/var/lib/mysql-files/data/invoices.csv"
INTO TABLE Invoices
FIELDS TERMINATED BY ";"
LINES TERMINATED BY "\n"
(invoice_id, vendor_id, invoice_number, invoice_date, invoice_total,
payment_total, credit_total, terms_id, invoice_due_date, payment_date);

 * mysql+pymysql://w-alkao:***@localhost
0 rows affected.
(pymysql.err.OperationalError) (1292, "Incorrect date value: 'NULL' for column 'payment_date' at row 89")
[SQL: LOAD DATA INFILE "/var/lib/mysql-files/data/invoices.csv"
INTO TABLE Invoices
FIELDS TERMINATED BY ";"
LINES TERMINATED BY "\n"
(invoice_id, vendor_id, invoice_number, invoice_date, invoice_total,
payment_total, credit_total, terms_id, invoice_due_date, payment_date);]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [59]:
%sql show tables;

 * mysql+pymysql://w-alkao:***@localhost
4 rows affected.

[('General_ledger_accounts',), ('Invoices',), ('Terms',), ('Vendors',)]

In [60]:
%sql SELECT * FROM Invoices;

 * mysql+pymysql://w-alkao:***@localhost
0 rows affected.

[]

In [42]:
%sql DESCRIBE Invoices

 * mysql+pymysql://w-alkao:***@localhost
10 rows affected.

[('invoice_id', 'int', 'NO', 'PRI', None, 'auto_increment'),
 ('vendor_id', 'int', 'NO', 'MUL', None, ''),
 ('invoice_number', 'varchar(50)', 'NO', '', None, ''),
 ('invoice_date', 'date', 'NO', '', None, ''),
 ('invoice_total', 'decimal(9,2)', 'NO', '', None, ''),
 ('payment_total', 'decimal(9,2)', 'NO', '', '0.00', ''),
 ('credit_total', 'decimal(9,2)', 'NO', '', '0.00', ''),
 ('terms_id', 'int', 'NO', 'MUL', None, ''),
 ('invoice_due_date', 'date', 'NO', '', None, ''),
 ('payment_date', 'date', 'YES', '', None, '')]